app/controllers/main_controller.rb

  def welcome
  	  @num_cars = Corvette.count
---
SELECT COUNT(*) FROM "corvettes"

  def result
  	  @year1 = params[:year1].to_i
  	  @year2 = params[:year2].to_i
  	  @body = params[:body]
  	  /*hello this is a comment/
  	  @selected_cars = Corvette.find(:all, :conditions => ["year >= ? and year <= ? and body_style = ?",
  	  	  @year1, @year2, @body])
---
SELECT "corvettes".* FROM "corvettes" WHERE (year >= 1990 and year <= 2010 and body_style = NULL)