demo/app/controllers/corvettes_controller.rb

SELECT "corvettes".* FROM "corvettes"
---
  def index
    @corvettes = Corvette.all

SELECT "corvettes".* FROM "corvettes" WHERE ("corvettes"."id" = 1) LIMIT 1
---
  def show
    @corvette = Corvette.find(params[:id])

SELECT "corvettes".* FROM "corvettes" WHERE ("corvettes"."id" = 1) LIMIT 1
---
  def edit
    @corvette = Corvette.find(params[:id])

INSERT INTO "corvettes" ("body_style", "miles", "year", "created_at", "updated_at") VALUES (NULL, NULL, NULL, '2010-12-09 20:39:22.593375', '2010-12-09 20:39:22.593375')
---
  def create
    @corvette = Corvette.new(params[:corvette])

    respond_to do |format|
      if @corvette.save

SELECT "corvettes".* FROM "corvettes" WHERE ("corvettes"."id" = 1) LIMIT 1
UPDATE "corvettes" SET "miles" = 100.0, "updated_at" = '2010-12-09 20:47:09.734000' WHERE ("corvettes"."id" = 3)
---
  def update
    @corvette = Corvette.find(params[:id])

    respond_to do |format|
      if @corvette.update_attributes(params[:corvette])

SELECT "corvettes".* FROM "corvettes" WHERE ("corvettes"."id" = 1) LIMIT 1
DELETE FROM "corvettes" WHERE ("corvettes"."id" = 1)
---
  def destroy
    @corvette = Corvette.find(params[:id])
    @corvette.destroy